run/realKE_silica_CCbase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.449e-08;

boundaryField
{
    bottomoutlet
    {
        type            zeroGradient;
    }
    negyinlet
    {
        type            fixedValue;
        value           uniform 1.449e-08;
    }
    posyinlet
    {
        type            fixedValue;
        value           uniform 1.449e-08;
    }
    topoutlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1.449e-08;
    }
}


// ************************************************************************* //
